donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/Battery/PowerManager.cpp
#include "PowerManager.h"

#include "macros_common.h"

#include <math.h>
#include <stdio.h>
#include <zephyr/sys/poweroff.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/shell/shell.h>

#include <zephyr/pm/pm.h>
#include <zephyr/pm/state.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>

#include <zephyr/zbus/zbus.h>

#ifdef CONFIG_BOOTLOADER_MCUBOOT
#include <zephyr/dfu/mcuboot.h>
#endif

#include <hal/nrf_ficr.h>

#include "../drivers/LED_Controller/KTD2026.h"
#include "../drivers/ADAU1860.h"
#include "../buttons/Button.h"
#include "../SensorManager/SensorManager.h"

#include "../utils/StateIndicator.h"

#include "bt_mgmt.h"
#include "bt_mgmt_ctlr_cfg_internal.h"

#include <zephyr/logging/log_ctrl.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(power_manager, LOG_LEVEL_DBG);

static const char *pm_state_name(enum pm_device_state state)
{
	switch (state) {
	case PM_DEVICE_STATE_ACTIVE:
		return "ACTIVE";
	case PM_DEVICE_STATE_SUSPENDED:
		return "SUSPENDED";
	case PM_DEVICE_STATE_SUSPENDING:
		return "SUSPENDING";
	case PM_DEVICE_STATE_OFF:
		return "OFF";
	default:
		return "UNKNOWN";
	}
}

static void log_power_diag_snapshot(const char *tag)
{
	enum pm_device_state s18 = PM_DEVICE_STATE_OFF;
	enum pm_device_state s33 = PM_DEVICE_STATE_OFF;
	const int s18_ret = pm_device_state_get(ls_1_8, &s18);
	const int s33_ret = pm_device_state_get(ls_3_3, &s33);

	battery_controller.exit_high_impedance();
	const uint8_t ls_ldo = battery_controller.read_ls_ldo_ctrl_raw();
	const uint8_t charge_ctrl = battery_controller.read_charge_ctrl_raw();
	const uint8_t fault = battery_controller.read_fault();
	const uint8_t ctrl = battery_controller.read_charging_state();
	battery_controller.enter_high_impedance();

	LOG_INF("[PWR_DIAG:%s] CHARGE_CTRL=0x%02X LS_LDO_CTRL=0x%02X CTRL=0x%02X FAULT=0x%02X",
		tag, charge_ctrl, ls_ldo, ctrl, fault);
	LOG_INF("[PWR_DIAG:%s] ls_1_8 en=%d state=%s ret=%d | ls_3_3 en=%d state=%s ret=%d",
		tag,
		pm_device_runtime_is_enabled(ls_1_8) ? 1 : 0,
		pm_state_name(s18), s18_ret,
		pm_device_runtime_is_enabled(ls_3_3) ? 1 : 0,
		pm_state_name(s33), s33_ret);
}

//K_TIMER_DEFINE(PowerManager::charge_timer, PowerManager::charge_timer_handler, NULL);

K_WORK_DELAYABLE_DEFINE(PowerManager::charge_ctrl_delayable, PowerManager::charge_ctrl_work_handler);

K_WORK_DELAYABLE_DEFINE(PowerManager::power_down_work, PowerManager::power_down_work_handler);

//K_WORK_DEFINE(PowerManager::power_down_work, PowerManager::power_down_work_handler);
//K_WORK_DEFINE(PowerManager::charge_ctrl_work, PowerManager::charge_ctrl_work_handler);
K_WORK_DEFINE(PowerManager::fuel_gauge_work, PowerManager::fuel_gauge_work_handler);
K_WORK_DEFINE(PowerManager::battery_controller_work, PowerManager::battery_controller_work_handler);

ZBUS_CHAN_DEFINE(battery_chan, struct battery_data, NULL, NULL, ZBUS_OBSERVERS_EMPTY,
    ZBUS_MSG_INIT(0));

static struct battery_data msg;

static k_work_delayable error_led_breathe_work;
static bool error_led_breathe_active;
static bool error_led_breathe_level;

static void error_led_breathe_handler(struct k_work *work)
{
	ARG_UNUSED(work);

	if (!error_led_breathe_active || !battery_controller.power_connected()) {
		gpio_pin_set_dt(&power_manager.error_led, 0);
		return;
	}

	error_led_breathe_level = !error_led_breathe_level;
	gpio_pin_set_dt(&power_manager.error_led, error_led_breathe_level ? 1 : 0);
	k_work_schedule(&error_led_breathe_work, K_MSEC(600));
}

static void error_led_breathe_start(void)
{
	error_led_breathe_active = true;
	k_work_schedule(&error_led_breathe_work, K_NO_WAIT);
}

static void error_led_breathe_stop(void)
{
	error_led_breathe_active = false;
	k_work_cancel_delayable(&error_led_breathe_work);
	power_manager.set_error_led(0);
}

//LoadSwitch PowerManager::v1_8_switch(GPIO_DT_SPEC_GET(DT_NODELABEL(load_switch), gpios));

void PowerManager::fuel_gauge_callback(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    LOG_DBG("Fuel Gauge GPOUT Interrupt");
    k_work_submit(&fuel_gauge_work);
}

void PowerManager::battery_controller_callback(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    k_work_submit(&battery_controller_work);
}

void PowerManager::power_good_callback(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    bool power_good = battery_controller.power_connected();

    k_work_submit(&fuel_gauge_work);

    if (power_good) {
        power_manager.last_charging_state = 0;
        power_manager.set_error_led(0);
        battery_controller.exit_high_impedance();
        power_manager.check_battery();
        battery_controller.enable_charge();
        battery_controller.enter_high_impedance();
        error_led_breathe_start();
        k_work_schedule(&charge_ctrl_delayable, K_NO_WAIT);
    } else {
        error_led_breathe_stop();
        k_work_cancel_delayable(&charge_ctrl_delayable);
        if (!power_manager.power_on) k_work_reschedule(&power_manager.power_down_work, K_NO_WAIT);
    }
}

void PowerManager::power_down_work_handler(struct k_work * work) {
	power_manager.power_down();
}

void PowerManager::charge_ctrl_work_handler(struct k_work * work) {
	power_manager.charge_task();
    // Schedule next execution
    k_work_schedule(&charge_ctrl_delayable, power_manager.chrg_interval);
}

void PowerManager::battery_controller_work_handler(struct k_work * work) {
    button_state state;

    //uint8_t val = gpio_pin_get_dt(&power_manager.error_led);
    //gpio_pin_set_dt(&power_manager.error_led, 1 - val);

    battery_controller.exit_high_impedance();
    state = battery_controller.read_button_state();
    battery_controller.enter_high_impedance();

    if (state.wake_2) {
        power_manager.power_on = !power_manager.power_on;
        //LOG_INF("Power on: %i", power_manager.power_on);

        if (!power_manager.power_on) power_manager.power_down();
    }

}

void PowerManager::fuel_gauge_work_handler(struct k_work * work) {
    int ret;
    battery_level_status status;

    msg.battery_level = fuel_gauge.state_of_charge();

    bat_status bat = fuel_gauge.battery_status();

    power_manager.get_battery_status(status);

