donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/Battery/PowerManager.cpp
    // full discharge
    //if (bat.FD) k_work_reschedule(&power_manager.power_down_work, K_NO_WAIT);
    if (power_manager.power_on && bat.SYSDWN) {
        LOG_WRN("Battery reached system down voltage.");
        k_work_reschedule(&power_manager.power_down_work, K_NO_WAIT);
    }

    if (bat.CHGINH) {
        power_manager.charging_disabled = true;
        battery_controller.disable_charge();
    } else if (power_manager.charging_disabled) {
        battery_controller.enable_charge();
    }

    float current;
    float target_current;
    float voltage;

    battery_controller.exit_high_impedance();

    uint16_t charging_state = battery_controller.read_charging_state() >> 6;
    gauge_status gs;

    switch (charging_state) {
        case 0:
            LOG_INF("charging state: discharge");
            msg.charging_state = DISCHARGING;

            gs = fuel_gauge.gauging_state();

            if (gs.edv2) {
                #ifdef CONFIG_BATTERY_ENABLE_LOW_STATE
                msg.charging_state = BATTERY_LOW;
                #endif
            }
            if (gs.edv1) {
                msg.charging_state = BATTERY_CRITICAL;
            }
            break;
        case 1:
            LOG_INF("charging state: charging");

            if (bat.SYSDWN) {
                msg.charging_state = PRECHARGING;
                break;
            }

            current = fuel_gauge.current();
            target_current = fuel_gauge.charge_current();
            voltage = fuel_gauge.voltage();

            msg.charging_state = POWER_CONNECTED;

            LOG_DBG("Voltage: %.3f V", voltage);
            LOG_DBG("Charging current: %.3f mA", current);
            LOG_DBG("Target current: %.3f mA", target_current);
            LOG_DBG("State of charge: %.3f %%", fuel_gauge.state_of_charge());

            // check if target current is met (if not tapering)
            if (current > 0.8 * target_current - 2 * power_manager._battery_settings.i_term) {
                msg.charging_state = CHARGING;
            } 
            else if (voltage > power_manager._battery_settings.u_term - 0.02) {
                #ifdef CONFIG_BATTERY_ENABLE_TRICKLE_CHARGE
                msg.charging_state = TRICKLE_CHARGING;
                #else
                msg.charging_state = CHARGING;
                #endif
            }
            
            break;
        case 2:
            LOG_INF("charging state: done");
            msg.charging_state = FULLY_CHARGED;
            break;
        case 3:
            LOG_WRN("charging state: fault");
            msg.charging_state = FAULT;

            uint8_t fault = battery_controller.read_fault();
            // Battery fuel gauge status
            bat_status status = fuel_gauge.battery_status();
            voltage = fuel_gauge.voltage();
            current = fuel_gauge.current();

            // cleared after read
            if (fault & (1 << 4)) {
                LOG_WRN("Input over voltage.");
            }

            // as long as fault exists
            if (fault & (1 << 5)) {
                bool power_connected = battery_controller.power_connected();
                if (power_connected && current > 0.5 * power_manager._battery_settings.i_term) {
                    msg.charging_state = PRECHARGING;
                }
                LOG_WRN("Battery under voltage: %.3f V", voltage);
            }

            // cleared after read
            if (fault & (1 << 6)) {
                LOG_WRN("Input under voltage");
            }

            // as long as fault exists
            if (fault & (1 << 7)) {
                LOG_WRN("Battery over voltage");
            }

            uint8_t ts_fault = battery_controller.read_ts_fault();

            if ((ts_fault >> 5) & 0x7) {
                LOG_WRN("TS_ENABLED: %i, TS FAULT: %i", ts_fault >> 7, (ts_fault >> 5) & 0x3);
                battery_controller.setup(power_manager._battery_settings);
            }

            LOG_DBG("------------------ Battery Info ------------------");
            LOG_DBG("Battery Status:");
            LOG_DBG("  Present: %d, Full Charge: %d, Full Discharge: %d", 
                    status.BATTPRES, status.FC, status.FD);

            // Basic measurements
            LOG_DBG("Basic Measurements:");
            LOG_DBG("  Voltage: %.3f V", voltage);
            LOG_DBG("  Current: %.3f mA", current);
            break;
    }

    battery_controller.enter_high_impedance();

    power_manager.last_charging_msg_state = msg.charging_state;
    
    // Adjust interval based on state
    if (msg.charging_state == FAULT || msg.charging_state == POWER_CONNECTED) {
        power_manager.chrg_interval = K_SECONDS(CONFIG_BATTERY_CHARGE_CONTROLLER_FAST_INTERVAL_SECONDS);
    } else {
        power_manager.chrg_interval = K_SECONDS(CONFIG_BATTERY_CHARGE_CONTROLLER_NORMAL_INTERVAL_SECONDS);
    }

	//ret = k_msgq_put(&battery_queue, &msg, K_NO_WAIT);
    ret = zbus_chan_pub(&battery_chan, &msg, K_FOREVER);
	if (ret) {
		LOG_WRN("power manager msg queue full");
	}
}

int PowerManager::begin() {
    earable_state oe_state;

    oe_state.charging_state = DISCHARGING;
    oe_state.pairing_state = PAIRED;

    battery_controller.begin();
    fuel_gauge.begin();
    earable_btn.begin();

    battery_controller.exit_high_impedance();

    uint8_t bat_state = battery_controller.read_charging_state();

    button_state btn = battery_controller.read_button_state();

    power_on = btn.wake_2;

    // get reset reason
    uint32_t reset_reas = NRF_RESET->RESETREAS;

    // reset the reset reason
    NRF_RESET->RESETREAS = 0xFFFFFFFF;
    
    if (reset_reas & RESET_RESETREAS_RESETPIN_Msk) {
        oe_boot_state.timer_reset = bat_state & (1 << 4);
        power_on |= oe_boot_state.timer_reset;
    }

    /*if (reset_reas & RESET_RESETREAS_DOG1_Msk) {
        printk("Reset durch Watchdog-Timer\n");
    }*/

    if (reset_reas & RESET_RESETREAS_SREQ_Msk) {
        LOG_INF("Rebooting ...");
        power_on = true;
    }

