donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/Battery/PowerManager.cpp
    /*if (reset_reas & RESET_RESETREAS_LOCKUP_Msk) {
        printk("Reset durch CPU Lockup\n");
    }*/

    battery_controller.setup(_battery_settings);
    log_power_diag_snapshot("after_setup");
    battery_controller.set_int_callback(battery_controller_callback);

    // check setup
    op_state state = fuel_gauge.operation_state();
    if (state.SEC != BQ27220::SEALED) {
        //battery_controller.setup();
        if (IS_ENABLED(CONFIG_OPENEARABLE_ADAU_I2C_TEST_SKIP_FUEL_GAUGE_SETUP)) {
            LOG_WRN("ADAU I2C test: skipping fuel gauge setup after operation_state check");
        } else {
            fuel_gauge.setup(_battery_settings);
        }
    }

    //k_timer_init(&charge_timer, charge_timer_handler, NULL);

    bool battery_condition = check_battery();

    if (!battery_condition) LOG_WRN("Battery check failed.");

    // check charging state
    bool charging = battery_controller.power_connected();

    if (IS_ENABLED(CONFIG_OPENEARABLE_ADAU_I2C_TEST_FORCE_POWER_ON)) {
        LOG_WRN("ADAU I2C test: forcing power-on to reach audio initialization");
        power_on = true;
    } else if (!battery_condition) {
        power_on = false;
        // LOG_ERR("Bad battery condition.");
        if (!charging){
            //TODO: Flash red LED once
            return power_down(false);
        }
    }

    if (charging) {
        power_manager.last_charging_state = 0;
        
        int ret = pm_device_runtime_enable(ls_1_8);
        if (ret != 0) {
            LOG_WRN("Error setting up load switch 1.8V.");
        }

        ret = pm_device_runtime_enable(ls_3_3);
        if (ret != 0) {
            LOG_WRN("Error setting up load switch 3.3V.");
        }

        //battery_level_status bat_status;
        //get_battery_status(&bat_status);

        oe_state.charging_state = POWER_CONNECTED;

        state_indicator.init(oe_state);
        error_led_breathe_start();

        k_work_schedule(&charge_ctrl_delayable, K_NO_WAIT);

        while(!power_on && battery_controller.power_connected()) {
            //__WFE();
            k_sleep(K_SECONDS(1));
        }
    } else {
        oe_state.charging_state = DISCHARGING;
    }

    if (!power_on) return power_down();

    //TODO: check power on condition
    // either not charging and edv1 or charging and edv0 and temperature
    
    battery_controller.set_power_connect_callback(power_good_callback);
    fuel_gauge.set_int_callback(fuel_gauge_callback);
    //battery_controller.set_int_callback(battery_controller_callback);

    //float voltage = battery_controller.read_ldo_voltage();
    //if (voltage != 3.3) battery_controller.write_LDO_voltage_control(3.3);

    battery_controller.enter_high_impedance();

    int ret = pm_device_runtime_enable(ls_1_8);
    if (ret != 0) {
        LOG_WRN("Error setting up load switch 1.8V.");
    }

    ret = pm_device_runtime_enable(ls_3_3);
    if (ret != 0) {
        LOG_WRN("Error setting up load switch 3.3V.");
    }

    ret = pm_device_runtime_enable(ls_sd);
    if (ret != 0) {
        LOG_WRN("Error setting up load switch SD.");
    }

    if (IS_ENABLED(CONFIG_OPENEARABLE_FORCE_RAILS_ALWAYS_ON)) {
        LOG_WRN("PWR_DIAG: forcing rails always on (diagnostic mode)");
        /* Keep PMIC/load switch outputs out of sleep/high-Z path. */
        battery_controller.exit_high_impedance();
        (void)battery_controller.write_LDO_voltage_control(3.3f);
        (void)battery_controller.write_LS_control(true);
        (void)pm_device_runtime_get(ls_1_8);
        (void)pm_device_runtime_get(ls_3_3);
    }

    log_power_diag_snapshot("after_runtime_enable");

    ret = device_is_ready(error_led.port); //bool
    if (!ret) {
        LOG_WRN("Error LED not ready.");
        //return -1;
    }

    ret = gpio_pin_configure_dt(&error_led, GPIO_OUTPUT_INACTIVE);
    if (ret != 0) {
        LOG_INF("Failed to set Error LED as output: ERROR -%i.", ret);
        //return ret;
    }

    // Check the configured design capacity, not the learned full-charge capacity.
    float design_capacity = fuel_gauge.design_cap();
    if (IS_ENABLED(CONFIG_OPENEARABLE_BQ27220_FORCE_SETUP_ON_BOOT)) {
        LOG_WRN("BQ27220 diagnostic: forcing fuel gauge setup on boot. design=%.3f",
                design_capacity);
        fuel_gauge.setup(_battery_settings);
        design_capacity = fuel_gauge.design_cap();
        LOG_INF("BQ27220 diagnostic: design capacity after forced setup: %.3f",
                design_capacity);
        if (fabsf(design_capacity - _battery_settings.capacity) > 1.0f) {
            LOG_WRN("Fuel gauge design capacity still mismatched after forced setup: %.3f",
                    design_capacity);
        }
    } else if (fabsf(design_capacity - _battery_settings.capacity) > 1.0f) {
        if (IS_ENABLED(CONFIG_OPENEARABLE_ADAU_I2C_TEST_SKIP_FUEL_GAUGE_SETUP)) {
            LOG_WRN("ADAU I2C test: skipping fuel gauge setup after design capacity check: %.3f",
                    design_capacity);
        } else {
            fuel_gauge.setup(_battery_settings);
            design_capacity = fuel_gauge.design_cap();
            if (fabsf(design_capacity - _battery_settings.capacity) > 1.0f) {
                LOG_WRN("Fuel gauge design capacity still mismatched after setup: %.3f",
                        design_capacity);
            }
        }
    }

#ifdef CONFIG_BOOTLOADER_MCUBOOT
    bool img_confirmed = boot_is_img_confirmed();

	if (!img_confirmed) {
		ret = boot_write_img_confirmed();
		if (ret) {
			LOG_ERR("Failed to confirm image");
			// reboot and revert to last confirmed image
			sys_reboot(SYS_REBOOT_COLD);
		}
        LOG_INF("Image confirmed");
        #ifdef CONFIG_SETUP_FUEL_GAUGE
        fuel_gauge.setup(_battery_settings);
        #endif
	}
#endif

    state_indicator.init(oe_state);

    k_work_init_delayable(&error_led_breathe_work, error_led_breathe_handler);
    if (battery_controller.power_connected()) {
        error_led_breathe_start();
    }

    uint32_t device_id[2];

    // Lesen der DEVICEID
    device_id[0] = nrf_ficr_deviceid_get(NRF_FICR, 0);
    device_id[1] = nrf_ficr_deviceid_get(NRF_FICR, 1);

    oe_boot_state.device_id = (((uint64_t) device_id[1]) << 32) | device_id[0];

