donghuixin/WentaoInhaler_DueAudioChannel_nRF5340Firm/src/Battery/PowerManager.cpp
    return 0;
}

void PowerManager::set_error_led(int val) {
    gpio_pin_set_dt(&error_led, val > 0 ? 1 : 0);
}

bool PowerManager::check_battery() {
    bool charging = battery_controller.power_connected();

    if (charging) {
        float voltage = fuel_gauge.voltage();

        if (voltage < _battery_settings.u_charge_prevent) {
            battery_controller.disable_charge();
            return false;
        }

        float temp = fuel_gauge.temperature();
        
        if (temp < _battery_settings.temp_min || temp > _battery_settings.temp_max) {
            // set params
            battery_controller.disable_charge();
            return false;
        } else if (temp < _battery_settings.temp_fast_min || temp > _battery_settings.temp_fast_max) {
            // set params
            battery_controller.write_charging_control(_battery_settings.i_charge / 2);
            battery_controller.enable_charge();
        } else {
            // normal params
            battery_controller.write_charging_control(_battery_settings.i_charge);
            battery_controller.enable_charge();
        }
    }

    bat_status bs = fuel_gauge.battery_status();
    if (bs.SYSDWN) return false;

    //gauge_status gs = fuel_gauge.gauging_state();
    //if (gs.edv1) return false; // critical battery state

    return true;
}

void PowerManager::get_battery_status(battery_level_status &status) {
    battery_controller.exit_high_impedance();
    uint8_t charging_state = battery_controller.read_charging_state() >> 6;

    status.flags = 0;
    status.power_state = 0x1; // battery_present

    // charging state
    if (battery_controller.power_connected())  {
        status.power_state |= (0x1 << 1); // external source wired (wireless = 3-4),
        if (charging_state == 0x1) {
            status.power_state |= (0x1 << 5); // charging
            status.power_state |= (0x1 << 9); // const current
        }
        else if (charging_state == 0x2) status.power_state |= (0x3 << 5); // inactive discharge
    } else {
        status.power_state |= (0x2 << 5); // active discharge
    }
    battery_controller.enter_high_impedance();

    // battery level
    gauge_status gs = fuel_gauge.gauging_state();

    // charge level
    if (gs.edv1) status.power_state |= (0x3 << 7); // critical
    else if (gs.edv2) status.power_state |= (0x2 << 7); // low
    else status.power_state |= (0x1 << 7); // good
	//	status.power_state |= (0x1 << 12); // fault reason
}

void PowerManager::get_energy_status(battery_energy_status &status) {
    float voltage = fuel_gauge.voltage();
    float current_mA = fuel_gauge.current();
    float capacity = fuel_gauge.capacity(); 

    status.flags = 0b00011010; // presence of fields
    status.voltage = sfloat_from_float(voltage);
    status.charge_rate = sfloat_from_float(voltage * current_mA / 1000);
    status.available_capacity = sfloat_from_float(3.7f * capacity / 1000);
}

void PowerManager::get_health_status(battery_health_status &status) {
    float state_of_health = fuel_gauge.state_of_health();
    int cycle_count = fuel_gauge.cycle_count();
    float temp = fuel_gauge.temperature(); 

    status.flags = 0b00000111; // presence of fields
    status.battery_health_summary = state_of_health;
    status.cycle_count = cycle_count;
    status.current_temperature = round(CLAMP(temp,-127,128));
}

void bt_disconnect_handler(struct bt_conn *conn, void * data) {
    int ret;
    struct bt_conn_info info;

    ret = bt_conn_get_info(conn, &info);
    if (ret != 0) return;
    
    if (info.state == BT_CONN_STATE_CONNECTED) {
        ret = bt_mgmt_conn_disconnect(conn, *((uint8_t*)data));
    }
}

void PowerManager::reboot() {
    int ret;
    
    // disconnect devices
    uint8_t data = BT_HCI_ERR_REMOTE_USER_TERM_CONN;
    bt_conn_foreach(BT_CONN_TYPE_ALL, bt_disconnect_handler, &data);

    ret = bt_le_adv_stop();

    stop_sensor_manager();

    ret = bt_mgmt_stop_watchdog();
    ERR_CHK(ret);

    dac.end();

    sys_reboot(SYS_REBOOT_COLD);
}

int PowerManager::power_down(bool fault) {
    int ret;

    // disconnect devices
    uint8_t data = BT_HCI_ERR_REMOTE_USER_TERM_CONN;
    bt_conn_foreach(BT_CONN_TYPE_ALL, bt_disconnect_handler, &data);

    ret = bt_le_adv_stop();

    // power disonnected
    // prepare interrupts

    led_controller.begin();
    led_controller.power_off();

    stop_sensor_manager();

    bool charging = battery_controller.power_connected();
    log_power_diag_snapshot("power_down_entry");

    if (IS_ENABLED(CONFIG_OPENEARABLE_FORCE_RAILS_ALWAYS_ON)) {
        LOG_WRN("PWR_DIAG: power_down blocked by OPENEARABLE_FORCE_RAILS_ALWAYS_ON");
        return 0;
    }

    if (!charging) {
        ret = battery_controller.set_wakeup_int();
        if (ret != 0) return ret;

        ret = fuel_gauge.set_wakeup_int();
        if (ret != 0) return ret;
        
        // check battery good
        //if (!fault) ret = power_switch.set_wakeup_int();
        //if (ret != 0) return ret;

        battery_controller.enter_high_impedance();
    }

    //TODO: prevent crashing with bt_disable (does not wake up)
    /*ret = bt_disable();

    if (ret != 0) {
        NVIC_SystemReset();
        sys_reboot(SYS_REBOOT_COLD);
    }*/

    if (fault) {
        LOG_WRN("Power off due to fault");
    } else {
        LOG_INF("Power off");
    }
    LOG_PANIC();

    ret = bt_mgmt_stop_watchdog();
    //ERR_CHK(ret);

    dac.end();

    // TODO: check states of load switch (should already be suspended
    // if all devieses have been terminated correctly)

    // turn off error led
	gpio_pin_set_dt(&error_led, 0);

    if (charging) {
        //NVIC_SystemReset();
        sys_reboot(SYS_REBOOT_COLD);
        return 0;
    }

    ret = pm_device_action_run(ls_sd,  PM_DEVICE_ACTION_SUSPEND);
    ret = pm_device_action_run(ls_3_3, PM_DEVICE_ACTION_SUSPEND);
    ret = pm_device_action_run(ls_1_8, PM_DEVICE_ACTION_SUSPEND);
    ret = pm_device_action_run(cons, PM_DEVICE_ACTION_SUSPEND);

    /*const struct device *const i2c = DEVICE_DT_GET(DT_NODELABEL(i2c1));
    ret = pm_device_action_run(i2c, PM_DEVICE_ACTION_SUSPEND);
    ERR_CHK(ret);*/

    /*const struct device *const watch_dog = DEVICE_DT_GET(DT_CHOSEN(zephyr_bt_hci_rpmsg_ipc));
    ret = pm_device_action_run(watch_dog, PM_DEVICE_ACTION_SUSPEND);
    ERR_CHK(ret);*/

    /*const struct device *const watch_dog = DEVICE_DT_GET(DT_ALIAS(watchdog0));
    ret = pm_device_action_run(watch_dog, PM_DEVICE_ACTION_SUSPEND);
    ERR_CHK(ret);*/

    sys_poweroff();

    // safety if poweroff failed
    k_msleep(1000);

    //NVIC_SystemReset();
    sys_reboot(SYS_REBOOT_COLD);
}


